teste3/app/Services/CategoryService.php

    public function getAllCategories(): array
    {

        $categories = $this->categoryModel->asObject()->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `id` DESC

    public function getCategory(int $id, bool $withDeleted = false)
    {
        $category = $this->categoryModel->withDeleted($withDeleted)->find($id);
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
AND `categories`.`id` = 2

    public function getMultinivel(string $name, $options = [])
    {

        $array = $this->categoryModel->asArray()->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `id` DESC