teste3/app/Services/CategoryService.php

    public function getCategory(int $id, bool $withDeleted = false)
    {
        $category = $this->categoryModel->withDeleted($withDeleted)->find($id);
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
AND `categories`.`id` = 8