teste3/app/Services/PlanService.php

SELECT *
FROM `plans`
WHERE `plans`.`deleted_at` IS NULL
---
    public function getAllPlans(): array
    {
        $plans = $this->planModel->findAll();

SELECT *
FROM `plans`
WHERE `plans`.`deleted_at` IS NOT NULL
---
    public function getAllArchived(): array
    {
        $plans = $this->planModel->onlyDeleted()->findAll();